export default class Model {
    constructor(){
        this.data = {
            author: "Іващенко Мирон",
            articles:[
                {title:"Основна інформація",text:
                    [`<b>Сфера наукових інтересів:</b> інтелектуальні автоматизовані системи, методи обробки нечітких та неповних даних.`,
                    `<b>Дисципліни, що викладає:</b> “Комп'ютерна дискретна математика”, “Сучасні методи теорії інформації та кодування”, “Теорія алгоритмів”, “Теорія прийняття рішень”, “Інтелектуальні системи підтримки прийняття рішень”, "Методи та системи штучного інтелекту".`,
                    `<b>Електронна пошта: </b> yuliyauyv@gmail.com, ulyanovska@umsf.dp.ua`
                    ]    
                },
                {title:"Біографія",text:
                    [`<b>У 1997 році</b> закінчила Дніпропетровський національний університет за спеціальністю математик, викладач математики.`,
                    `<b>У 2005 році</b> присуджено науковий ступінь кандидата технічних наук спеціальністю 05.13.06 – автоматизовані системи управління та прогресивні інформаційні технології (тема дисертації «Моделі та методи обробки даних в єдиній автоматизованій інформаційній системі митної служби»).`,
                    ]    
                },
                {title:"Організаціяна діяльність",text:
                    [`<b>З 2018 року:</b> в.о. завідувача кафедри інформаційних систем та технологій Університету митної справи та фінансів`,
                    `<b>З 2019 року:</b> завідувач кафедрі комп’ютерних наук та інженерії програмного забезпечення.`,
                    `<b>2018 р.</b> - заступник відповідального секретаря приймальної комісії з вивчення документів вступників, які мають пільги на зарахування поза конкурсом (наказ № 34 від 20.02.2018 р.)`,
                    `<b>2018 р.:</b> робота у складі журі міжнародного конкурсу візуальних презентацій «День острова Токто», який проводився в Університеті митної справи та фінансів за участі Посольства Республіки Кореї в Україні 04.06.2018 р.`,
                    `<b>2019 р. -</b> заступник відповідального секретаря приймальної комісії з вивчення документів вступників, які мають пільги на зарахування поза конкурсом (наказ № 174 від 04.12.2019)`,
                    `<b>З 2021 року</b> виконує обов’язки куратора групи К 21-1м.`,
                    `<b>З 2022 року</b> виконує обов’язки куратора груп К 22-1м та К 22-2м.`
                    ]    
                }
            ],
        }
    }
    
    getData(){
        return this.data;
    }
}